import cv2
import numpy as np

# 画像のサイズを指定
width  = 662
height = 1263 
# Max_Y_cv = 1263
# Max_X_cv = 662

# 画像を生成して茶色っぽい色で塗りつぶす
image = np.full((height, width, 3), (65, 105, 225), dtype=np.uint8)


# cvから見たros座標原点(x0,y0)
x0_cv = 301
y0_cv = 1263


corner_num = 4
polygon_num = 10

# 入力のros座標系([x_ros,y_ros])
polygon_ros = { 0:[[912.5,54.5],[912.5,47.0],[0.0,47.0],[0.0,54.5]],
                1:[[912.5,193.5],[912.5,54.5],[905.0,54.5],[905.5, 193.5]],
                2:[[1020.5,193.5],[1020.5,186.0],[912.5,186.0],[912.5,193.5]],
                3:[[1020.5,301.0],[1020.5,193.5],[1013.0,193.5],[1013.0,301.0]],
                4:[[1135.5,301.0],[1135.5,176.0],[1128.0,176.0],[1128.0,301.0]],
                5:[[1263.0,183.5],[1263.0,176.0],[1135.5,176.0],[1135.5,183.5]],
                6:[[1263.0,82.0],[1263.0,75.0],[1141.0,75.0],[1141.0,82.0]],
                7:[[1148.5,75.0],[1148.5,-361.0],[1141.0,-361.0],[1141.0, 75.0]],
                8:[[1009.5,-54.5],[1009.5,-361.0],[1002.0,-361.0],[1002.0,-54.5]],
                9:[[1009.5,-47.0],[1009.5,-54.5],[0.0,-54.5],[0.0,-47.0]],
                }

# 出力先のcv座標系([x_cv,y_cv])
polygon_cv = {}


# polygon_ros[key][何個目の座標か][xかyか]
for i in range(polygon_num): #ポリゴンが10個あるから
    coodinate = []
    for j in range(corner_num): # 4つ角だから 
        x_cv = x0_cv - polygon_ros[i][j][1] #x_cv = x0_cv - y_ros
        y_cv = y0_cv - polygon_ros[i][j][0] #y_cv = y0_cv - x_ros
        coodinate.append([x_cv,y_cv])
    polygon_cv[i] = coodinate

# 左上から右上、右下そして左下の座標の順番
for i in range(polygon_num):
    print("{}: {}".format(i, polygon_cv[i]))
